burning-server/app/controllers/airplanes_controller.rb

INSERT INTO "airplanes" ("name", "rows", "cols", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "testnew plane"], ["rows", 23], ["cols", 4], ["created_at", "2018-06-05 09:16:02.002254"], ["updated_at", "2018-06-05 09:16:02.002254"]]
---
  def create
    airplane = Airplane.new airplane_params
    airplane.save

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
  @airplane = Airplane.find params[:id]

SELECT "airplanes".* FROM "airplanes"
---
  def index
    @airplanes = Airplane.all

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @airplane = Airplane.find(params[:id])

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "airplanes" SET "rows" = $1, "cols" = $2, "updated_at" = $3 WHERE "airplanes"."id" = $4  [["rows", 22], ["cols", 5], ["updated_at", "2018-06-05 09:16:15.726835"], ["id", 4]]
---
  def update
    airplane = Airplane.find(params[:id])
    airplane.update_attributes(airplane_params)

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "airplanes" WHERE "airplanes"."id" = $1  [["id", 4]]
---
  def destroy
    @airplane = Airplane.find(params[:id])
    @airplane.destroy