burning-server/app/controllers/flights_controller.rb

  def show
    @flight = Flight.find(params[:id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def index
    @flights = Flight.all
---
SELECT "flights".* FROM "flights"